---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternTable.GetKeys
source: html/d628e834-83cf-fda4-b08d-dc94c65525ea.htm
---
# Autodesk.Revit.DB.ExportPatternTable.GetKeys Method

Gets all the keys stored in the map.

## Syntax (C#)
```csharp
public IList<ExportPatternKey> GetKeys()
```

## Returns
Return the key array.